Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Maximum parallel compile jobs: This value sets the maximum number of CPU cores to dedicate to compiling a project.
zh_cn: 最大并行编译作业: 该值设置编译时使用CPU核心的 最大 值。

source: Maximum size for DnD™ toolbox action thumbnails: At the bottom of the Action Toolbox you have a slider for changing the size of the Drag and Drop icons.
zh_cn: DnD™ 工具栏动作缩略图的最大尺寸: 在动作工具栏的底部有一个滑块来改变拖拽图标的大小。

source: Maximum size of toolbox Action thumbnails: At the bottom of the Action Toolbox you have a slider for changing the size of the Drag and Drop icons.
zh_cn: 工具箱中动作按钮的缩略图最大尺寸（Maximum size of toolbox Action thumbnails）：在动作按钮工具箱的底部你会看到一个滑条来改变拖拽按钮的图标大小。

source: Maximum windows to display: This sets the maximum number of previously opened windows that will be shown within the Recent Windows list.
zh_cn: 可显示窗口的最大数量: 设置最近窗口列表中显示之前打开窗口的最大数量。

source: Maximum zoom (%): This sets the maximum zoom value permitted for the resource tree.
zh_cn: 最大缩放倍数（%）: 设置资源树允许的最大缩放值。

source: Minimum code window height - Set the minimum height (in pixels) permitted by the code window.
zh_cn: 最小代码窗口高度 - 设置代码编辑器窗口的最小高度（像素）。

source: Minimum code window width - Set the minimum width (in pixels) permitted by the code window.
zh_cn: 最小代码窗口宽度 - 设置代码编辑器窗口的最小宽度（像素）。

source: Minimum size for DnD™ toolbox action thumbnails: At the bottom of the Action Toolbox you have a slider for changing the size of the Drag and Drop icons.
zh_cn: DnD™ 工具栏动作缩略图的最小尺寸: 在动作工具栏的底部有一个滑块来改变拖拽图标的大小。

source: Minimum size of toolbox Action thumbnails: At the bottom of the Action Toolbox you have a slider for changing the size of the Drag and Drop icons.
zh_cn: 工具箱中动作按钮的缩略图最小尺寸（Minimum size of toolbox Action thumbnails）：在动作按钮工具箱的底部你会看到一个滑条来改变拖拽按钮的图标大小。

source: Minimum zoom (%): This sets the minimum zoom value permitted for the resource tree.
zh_cn: 最小缩放倍数（%）: 设置资源树允许的最小缩放值。

source: Minimum zoom level for interacting with window contents (%): This option controls the zoom cut-off point at which the mouse will no longer be able to interact with workspace windows (ie: add nodes, drag windows, etc...).
zh_cn: 与窗口内容交互的最小缩放级别（%）: 此选项设置鼠标不再能与工作区窗口交互的距离（如：添加节点、拖拽窗口等）。

source: Minimum zoom level to allow mouse interaction with window contents: This option controls the zoom cut-off point at which the mouse will no longer be able to interact with workspace windows (ie: add nodes, drag windows, etc...).
zh_cn: 允许鼠标与窗口内容互动的最小缩放级别（Minimum zoom level to allow mouse interaction with window contents）：该选项控制缩放的中断点，缩放级别低于该点时鼠标酱不再与工作区内的窗口进行互动（例如：增加节点、拖拽窗口等……）。

source: Miscellaneous Options: These options affect certain global colour properties for the resource tree:
zh_cn: 杂项: 这些选项影响资源树的某些全局颜色属性：

source: Mouse down time to start dragging nodes (ms): When you click on a node and drag it, you will be repositioning the node within the action code.
zh_cn: 鼠标按下到开始拖动节点所需的时间（毫秒）: 当你点击一个节点并拖拽它时，你将重新定位动作代码中的节点。

source: Mouse wheel zoom requires Ctrl key: When this is checked all editors (and the main workspace) will have zoom enabled with / + the mouse wheel , while un-checking it will enable zoom with only the mouse wheel .
zh_cn: 鼠标滚轮缩放需要 Ctrl 键: 勾选此选项所有编辑器（和主工作区）都需要使用 / + 鼠标滚轮 进行缩放，否则 只 需要使用鼠标滚轮 进行缩放。

source: Mouse-over anchor point colour - The colour to be used to draw the anchor points that are active.
zh_cn: 鼠标悬停的锚点颜色 - 设置用于绘制活动锚点的颜色。

source: Mouse-over invalid anchor point colour - The colour to be used to draw the anchor points that are active but invalid.
zh_cn: 鼠标悬停的无效锚点颜色 - 设置用于绘制活动但无效的锚点的颜色。

source: Move focused windows to top: When this is enabled and you click on any item in the Recent Window list, the selected item will be moved to the top of the list.
zh_cn: 将焦点窗口移至顶部: 启用该选项并点击最近窗口列表中的任一项时，选定的项将被移动到列表的顶部。

source: My Account - This option will open your default web browser and take you to your YoYo Account page.
zh_cn: 我的帐户（My Account） - 该选项将会在你的默认网页浏览器上打开您的 YoYo Account（YYA）帐户页面。

source: My Account - sign in to your YoYo Account (see here for more details)
zh_cn: 我的帐户（My Accounts） - 登录到你的YoYo帐户（详情参见这里）

source: My Library - View your current Marketplace content library.
zh_cn: 我的库（My Library） - 查看你当前的市场内容库。

source: My Purchase History - This option will open a browser and take you to the account page for the logged in user so you can see the purchase history for that account.
zh_cn: 我的购买历史记录（My Purchase History） - 该选项将会打开一个浏览器并带你到你的账户页面，在这个页面里你可以看到你为此账户购买的历史记录。

source: NOTE: Due to the modular nature of GameMaker Studio 2 there are certain things that are not included in this user manual, particularly those aspects of setting up and connecting the different devices that can be supported.
zh_cn: 注意： 由于 GameMaker Studio 2的模块性质，也有一些不包括在手册之内，特别是那些可支持的不同设备的设置和连接。

source: NOTE: Due to the way that this works internally, passing arrays to scripts may affect performance, especially if the array is very large.
zh_cn: 注意： 出于这个内在机制，向脚本传递数组将影响运行效率，尤其是数组非常大时。

source: NOTE: If you are resizing the application surface, these changes will not be registered until the start of the next draw frame, meaning that calling the surface_get_width() or surface_get_height() functions in the same event or step will return the previous values.
zh_cn: 注：如果你重置应用表面层的大小，它不会马上发生改变，直至下一个绘制帧，这意味着在同一个事件或者步事件中使用 surface_get_width() 或者 surface_get_height() 函数将返回之前的值。

source: NOTE: If your HTML5 game uses a custom index.html and that sets the canvas to a fixed position then this function will have no effect on the window position.
zh_cn: 注意: 如果你的 HTML5 游戏使用用户自定义的index.html ，并且设置画布（canvas）至固定的位置，那么这个函数在窗口位置将无效。

source: NOTE: Many of the watch windows (like Global, Local or Watches) will not update while the game is running, and will require that you pause the game or set a breakpoint before they are updated.
zh_cn: 注意：许多监视窗口（例如全局，局部，或监视）并不会在游戏运行时更新，它们需要你暂停游戏或者在它们更新前设置断点。

source: NOTE: On Windows8 SurfaceRT devices, there is a canvas limit of 2048x2048, which means the drawing canvas cannot go above those dimensions (neither with views, nor by setting the game window directly) otherwise your game graphics will be corrupted or degraded.
zh_cn: 注： Windows8 SurfaceRT 设备限制了画布大小为 2048x2048，这意味着绘制的画布不能超过这个尺寸（视野或者直接设置游戏窗口都不可以），否则游戏画面将不堪忍受或降级。

source: NOTE: On the YoYo Compiler target platforms (those marked (YYC)), these expressions are evaluated from left to right, while on all other target platforms they are evaluated from right to left, meaning that this:
zh_cn: 注意： 在YYC目标平台（即标记YYC的目标平台），这些表达式是从左到右进行求值的，而在其它目标平台可能会是从右到左，这意味着：

source: NOTE: Restarting the game will not clear or delete the buffer!
zh_cn: 注意： Restarting the game will not clear or delete the buffer!

source: NOTE: The above is not necessary if you are not changing any of the array values, but rather simply referencing them.
zh_cn: 注意： 如果不更改数组的值， 没有 必要那写，仅需要引用即可。

source: NOTE: The only thing you cannot do with the application surface is free it.
zh_cn: 注： 唯一你 不可以 操作的是释放应用表面层。

source: NOTE: The variable async_load which is mentioned in the following sections is only valid in these events, as the ds_map that is points to is created at the start of the event, then deleted again at the end, with this variable being reset to a value of -1 at all other times.
zh_cn: 注意： The variable async_load which is mentioned in the following sections is only valid in these events, as the ds_map that is points to is created at the start of the event, then deleted again at the end, with this variable being reset to a value of -1 at all other times.

source: NOTE: This is only for use in the same room, and not for generating complete saved games for after your game has been closed or restarted!
zh_cn: 注意： This is only for use in the same room, and not for generating complete saved games for after your game has been closed or restarted!

source: NOTE: To import a previous GameMaker project into GameMaker Studio 2 it must have been created using the 1.4 version, and even then it may not work directly on import.
zh_cn: 注意： 欲导入之前版本的 GameMaker 项目到 GameMaker Studio 2 中，你必须保证这个项目是使用1.4版本创建的，而且即便如此也不能保证导入后直接就能正常运作。

source: NOTE: When working with surfaces there is the possibility that they can cease to exist at any time due to them being stored in texture memory.
zh_cn: 注：由于储存在显存里，表面层运行时存在随时停止并退出的可能性。

source: NOTE: texture swaps and vertex batches will never be zero and will normally show values of 2 or 3, since even with an empty room an no objects GameMaker Studio 2 still has to draw and batch things.
zh_cn: 注意: 纹理交换和顶点批次永远不会为零，通常会显示2或3，因为即使空房间内没有物体，GameMaker Studio 2 仍然需要绘制和批处理。

source: NOTE: GameMaker Studio 2 currently permits up to 128 distinct purchase options per title, except if you are using the Amazon Store (for Android) where it is limited to 100.
zh_cn: 注意： GameMaker Studio 2 currently permits up to 128 distinct purchase options per title, except if you are using the Amazon Store (for Android) where it is limited to 100.

source: NOTE: A joint does not need to be deleted when you destroy an instance joined to another instance, nor does it need to be deleted at the end of a room.
zh_cn: 注意： 关节不需要在删除所连接的实例的时候被删除，也不需要在房间结束时删除。

source: NOTE: A particle emitter, once created, remains resident in the system memory for the duration of the game, and so if you need to recreate it at any point (for example, if you call the Restart Game action), then you must destroy the current particle emitter otherwise you get a memory leak.
zh_cn: 注意： A particle emitter, once created, remains resident in the system memory for the duration of the game, and so if you need to recreate it at any point (for example, if you call the Restart Game action), then you must destroy the current particle emitter otherwise you get a memory leak.

source: NOTE: A particle system, once created, remains resident in the system memory for the duration of the game, and so if you need to recreate it at any point (for example, if you call the Restart Game action), then you must destroy the current system otherwise you get a memory leak.
zh_cn: 注意： A particle system, once created, remains resident in the system memory for the duration of the game, and so if you need to recreate it at any point (for example, if you call the Restart Game action), then you must destroy the current system otherwise you get a memory leak.

source: NOTE: A particle type, once created, remains resident in the system memory for the duration of the game, and so if you need to recreate it at any point (for example, if you call the Restart Game action), then you must destroy the current particle type otherwise you get a memory leak.
zh_cn: 注意： A particle type, once created, remains resident in the system memory for the duration of the game, and so if you need to recreate it at any point (for example, if you call the Restart Game action), then you must destroy the current particle type otherwise you get a memory leak.

source: NOTE: A sensor fixture will fire off the collision event when the collision first occurs only, meaning you don't get a stream of collision events as the two bodies continue to overlap (which is what would traditionally occur).
zh_cn: 注意</ b0>：当碰撞仅发生时，传感器夹具将触发碰撞事件，这意味着当两个物体继续重叠时，不会遇到碰撞事件流（这是传统上会发生的）。

source: NOTE: All uniforms must be set after calling the function shader_set(), and before calling shader_reset.
zh_cn: 注意： All uniforms must be set after calling the function shader_set(), and before calling shader_reset.

source: NOTE: Android requires that you add the GCM Sender ID into the Android Game Options.
zh_cn: 注意： Android requires that you add the GCM Sender ID into the Android Game Options.

source: NOTE: As with all dynamic resources, data structures take up memory and so should always be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.
zh_cn: 注意： As with all dynamic resources, data structures take up memory and so should always be destroyed when no longer needed to prevent memory leaks which will slow down and eventually crash your game.

source: NOTE: Be aware that the larger the size of the texture page, the less compatible your game will be on Macs with lower specifications.
zh_cn: 注意： Be aware that the larger the size of the texture page, the less compatible your game will be on Macs with lower specifications.

source: NOTE: Be aware that the larger the size of the texture page, the less compatible your game will be on PC's with lower specifications.
zh_cn: 注意： Be aware that the larger the size of the texture page, the less compatible your game will be on PC's with lower specifications.

source: NOTE: Be aware that the larger the size of the texture page, the less compatible your game will be on UWP devices with lower specifications.
zh_cn: 注意： Be aware that the larger the size of the texture page, the less compatible your game will be on UWP devices with lower specifications.

source: NOTE: Be aware that the larger the size of the texture page, the less compatible your game will be.
zh_cn: 注意： Be aware that the larger the size of the texture page, the less compatible your game will be.

source: NOTE: Before doing a final build of your project for release, you should always clear the Asset Compiler Cache (using the "broom" icon at the top of the IDE) to ensure that all cached files are recreated and no stale files corrupt your final game.
zh_cn: 注意: 在完成发布项目的最终构建之前，您应该清除资源编译器缓存 （使用 IDE 顶部的“扫帚”图标 ），以确保重新创建所有缓存文件，且不会有失效的文件损坏您最终的游戏包。

source: NOTE: Before you go off splitting up your graphics over various texture pages, you should be aware that this is not always necessary, nor is it always the most efficient way to work.
zh_cn: 注意： Before you go off splitting up your graphics over various texture pages, you should be aware that this is not always necessary, nor is it always the most efficient way to work.

source: NOTE: By default you need to select "Clear Display Buffer" in the room editor for the colour to be shown, and you can only set the colour using the function window_set_colour().
zh_cn: 注意： By default you need to select "Clear Display Buffer" in the room editor for the colour to be shown, and you can only set the colour using the function window_set_colour().

source: NOTE: Due to the complexity of skeletal animations, the preview image shown in the sprite editor is not intended to accurately represent your animation, but rather give you a simple image that represents the animation for visualising in the room editor.
zh_cn: 注意： Due to the complexity of skeletal animations, the preview image shown in the sprite editor is not intended to accurately represent your animation, but rather give you a simple image that represents the animation for visualising in the room editor.

source: NOTE: For games with localizations it is very important that accented letters can be read from external files.
zh_cn: 注意： For games with localizations it is very important that accented letters can be read from external files.

source: NOTE: For regular mouse functions see the section on Mouse Input.
zh_cn: 注意：对于常规的鼠标函数请参见鼠标输入部分。

source: NOTE: GameMaker Studio 2 is not completely backwards compatible with GameMaker: Studio 1.4 projects but imported 1.4 projects should still run, as obsolete functionality has been recreated for you automatically using compatibility scripts.
zh_cn: 注意：GameMaker Studio 2 不会完全向后兼容GameMaker: Studio 1.4的项目，但是导入1.4项目 应该 仍然可以运行，因为弃用函数（Obsolete Functions）已经自动使用 兼容脚本（Compatibility Scripts）重建了。

source: NOTE: How the image looks in your chosen preview editor will not be the same as how it looks in your game, nor how it looks in the preview window of the sprite editor.
zh_cn: 注意： How the image looks in your chosen preview editor will not be the same as how it looks in your game, nor how it looks in the preview window of the sprite editor.

source: NOTE: If you are adding fonts to your game, make sure you have the licence necessary to re-distribute it, unless it is public domain or copyright free.
zh_cn: 注意：如果您在游戏中使用某字体，请确保您拥有该字体的使用许可证，公用或者免版税字体除外。

source: NOTE: If you are not sure that you need these, you should probably just leave them un-checked by default and let GameMaker: Studio deal with the permissions for your game.
zh_cn: 注意： If you are not sure that you need these, you should probably just leave them un-checked by default and let GameMaker: Studio deal with the permissions for your game.

source: NOTE: If you are using an external repository, then you should be using the username and password associated with the account set up for that repository, but if you are wanting to use a local repository then you can use any username and password.
zh_cn: 注意： If you are using an external repository, then you should be using the username and password associated with the account set up for that repository, but if you are wanting to use a local repository then you can use any username and password.

source: NOTE: If you choose not to perform the create event, you may encounter errors if the instance depends on any variables initialised in this event.
zh_cn: 注意： If you choose not to perform the create event, you may encounter errors if the instance depends on any variables initialised in this event.

source: NOTE: If you give a key that does not exist in the map then the action will return undefined.
zh_cn: 注意： If you give a key that does not exist in the map then the action will return undefined.

source: NOTE: If you give a position that is outside of the given list size (ie: position 11 in a 10 value list) then the action will return undefined.
zh_cn: 注意： If you give a position that is outside of the given list size (ie: position 11 in a 10 value list) then the action will return undefined.

source: NOTE: If you need the emitter to move with an instance, you will have to use this function in the step event and update the emitter position that way.
zh_cn: 注意： If you need the emitter to move with an instance, you will have to use this function in the step event and update the emitter position that way.

source: NOTE: If you use this action then you should not use the action Set Particle Shape as you can only have a sprite or a shape, but not both.
zh_cn: 注意： If you use this action then you should not use the action Set Particle Shape as you can only have a sprite or a shape, but not both.

source: NOTE: If you use this action then you should not use the action Set Particle Sprite as you can only have a sprite or a shape, but not both.
zh_cn: 注意： If you use this action then you should not use the action Set Particle Sprite as you can only have a sprite or a shape, but not both.

source: NOTE: Implementing the server-side is entirely up to the end user, and YoYo Games do not provide any support for that side of things, other than basic set-up information available from their Knowledge Base.
zh_cn: 注意： Implementing the server-side is entirely up to the end user, and YoYo Games do not provide any support for that side of things, other than basic set-up information available from their Knowledge Base.

source: NOTE: In the actual editor window where you place the different assets on their layers, you can hold down "P" + anywhere to instantly select the asset and skip to the layer that it has been placed on.
zh_cn: 注意： In the actual editor window where you place the different assets on their layers, you can hold down "P" + anywhere to instantly select the asset and skip to the layer that it has been placed on.

source: NOTE: It's important that you remove any dynamically created resources like this from memory when you no longer need them to prevent memory leaks, so when you are finished with the buffer that you have created you should free it up again using Delete Buffer action (in the Other - Clean Up event, for example).
zh_cn: 注意： It's important that you remove any dynamically created resources like this from memory when you no longer need them to prevent memory leaks, so when you are finished with the buffer that you have created you should free it up again using Delete Buffer action (in the Other - Clean Up event, for example).

source: NOTE: It's important to always remove any dynamically created resources from memory when you no longer need them to prevent memory leaks.
zh_cn: 注意： It's important to always remove any dynamically created resources from memory when you no longer need them to prevent memory leaks.

source: NOTE: Legacy format *.GEX extensions are no longer supported and cannot be imported in to GameMaker Studio 2 projects.
zh_cn: 注意： Legacy format *.GEX extensions are no longer supported and cannot be imported in to GameMaker Studio 2 projects.

source: NOTE: Please note that you must have enabled Remote Login on the target mac.
zh_cn: 注意： Please note that you must have enabled Remote Login on the target mac.

source: NOTE: Sharing a local project repository (even through a file synchronization service like Dropbox) isn't recommended, as commits are generally written directly to it, and thus you have very little conflict protection.
zh_cn: 注意： Sharing a local project repository (even through a file synchronization service like Dropbox) isn't recommended, as commits are generally written directly to it, and thus you have very little conflict protection.

source: NOTE: Some windows will disappear from the dock when you change editors, like in the room editor.
zh_cn: 注意： 当更改编辑器时，某些窗口将从底栏中消失，如在房间编辑器中。

source: NOTE: Strings support form feed, vertical tab etc... but this does not mean to say that rendering does, and when drawing strings these characters may be ignored.
zh_cn: 注意： Strings support form feed, vertical tab etc... but this does not mean to say that rendering does, and when drawing strings these characters may be ignored.

source: NOTE: Take care when using this option as you can quickly use up all the available texture memory, especially on mobile devices, if you have too many texture pages.
zh_cn: 注意： Take care when using this option as you can quickly use up all the available texture memory, especially on mobile devices, if you have too many texture pages.

source: NOTE: The "title" argument is ignored on iOS and the game name is shown instead.
zh_cn: 注意： The "title" argument is ignored on iOS and the game name is shown instead.

source: NOTE: The alpha component of the colour is not used, only the RGB components from the colour picker.
zh_cn: 注意： The alpha component of the colour is not used, only the RGB components from the colour picker.

source: NOTE: The clamped value given above is what GameMaker Studio 2 attempts to clamp the range to, but this value is not guaranteed on all target platforms.
zh_cn: 注意： The clamped value given above is what GameMaker Studio 2 attempts to clamp the range to, but this value is not guaranteed on all target platforms.

source: NOTE: The first time you run a game on a target that requires the Micro Web Server its possible that you will get a firewall alert.
zh_cn: 注意：当你首次通过MWS在目标平台上运行游戏时可能会得到防火墙警报。

source: NOTE: The layer selected must have been defined as a Tilemap Layer in the room editor, otherwise you may get errors.
zh_cn: 注意： The layer selected must have been defined as a Tilemap Layer in the room editor, otherwise you may get errors.

source: NOTE: The value of this variable is not the same as the identifier that the instance is given in the room editor and is also different to the instance_id array which contains all the ids of all the currently active instances.
zh_cn: 注意： The value of this variable is not the same as the identifier that the instance is given in the room editor and is also different to the instance_id array which contains all the ids of all the currently active instances.

source: NOTE: There are only 8 hardware lights available, so only 8 defined lights can be enabled at any one time (although more can be defined).
zh_cn: 注意： There are only 8 hardware lights available, so only 8 defined lights can be enabled at any one time (although more can be defined).
